{
    "rule_id": "ac5a6409-8c89-44c2-8d64-668c29a2d756", 
    "id": "ac5a6409-8c89-44c2-8d64-668c29a2d756", 
    "author": ["https://elastic-content-share.eu","Arnim Rupp, Florian Roth"], 
    "from": "now-15m", "index": ["filebeat-*","logs-*"], 
    "interval": "5m", 
    "language": "lucene", 
    "output_index": ".siem-signals-default", 
    "references": ["https://support.citrix.com/article/CTX267679", "https://support.citrix.com/article/CTX267027", "https://isc.sans.edu/diary/25686", "https://twitter.com/mpgn_x64/status/1216787131210829826", "https://github.com/x1sec/x1sec.github.io/blob/master/CVE-2019-19781-DFIR.md"], 
    "false_positives": ["Unknown"], 
    "risk_score": 100, 
    "name": "Citrix Netscaler Attack CVE-2019-19781", 
    "description": "Detects CVE-2019-19781 exploitation attempt against Citrix Netscaler, Application Delivery Controller and Citrix Gateway Attack", 
    "query": "url.original:(*\\/..\\/vpns\\/* OR *\\/vpns\\/cfg\\/smb.conf OR *\\/vpns\\/portal\\/scripts\\/*.pl*)", 
    "severity": "critical", 
    "tags": ["elastic-content-share","Sigma","web"], 
    "to": "now", 
    "type": "query", 
    "threat": [{"framework": "MITRE ATT&CK", 
    "tactic": {"id": "TA0001", "name": "Initial Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, 
    "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], 
    "throttle": "no_actions", "note": ""}