{"rule_id": "1da8ce0b-855d-4004-8860-7d64d42063b1", "id": "1da8ce0b-855d-4004-8860-7d64d42063b1", "author": ["https://elastic-content-share.eu","Florian Roth"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["http://www.securityfocus.com/infocus/1633"], "false_positives": ["Unknown"], "risk_score": 75, "name": "Apache Segmentation Fault", "description": "Detects a segmentation fault error message caused by a creashing apache worker process", "query": "exit\\ signal\\ Segmentation\\ Fault", "severity": "high", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0040", "name": "Impact", "reference": "https://attack.mitre.org/tactics/TA0040"}, "technique": [{"id": "T1499", "name": "Endpoint Denial of Service", "reference": "https://attack.mitre.org/techniques/T1499"}, {"id": "T1499.004", "name": "Application or System Exploitation", "reference": "https://attack.mitre.org/techniques/T1499/004"}]}], "throttle": "no_actions", "note": ""}

{
"rule_id": "e9a2b582-3f6a-48ac-b4a1-6849cdc50b3c", 
"id": "e9a2b582-3f6a-48ac-b4a1-6849cdc50b3c", 
"author": "Pratik Bambhania", 
"from": "now-15m", 
"index": ["filebeat-*","logs-*"], 
"interval": "5m", 
"language": "lucene", 
"output_index": ".siem-signals-default", 
"references": ["https://github.com/hannob/apache-uaf/blob/master/README.md"], 
"false_positives": ["https://bz.apache.org/bugzilla/show_bug.cgi?id=46185"], 
"risk_score": 50, 
"name": "Apache Threading Error", 
"description": "Detects an issue in apache logs that reports threading related errors", 
"query": "__pthread_tpp_change_priority\\:\\ Assertion\\ `new_prio\\ \\=\\=\\ \\-1\\ \\||\\ \\(new_prio\\ >\\=\\ fifo_min_prio\\ \\&&\\ new_prio\\ <\\=\\ fifo_max_prio\\)", "severity": "medium", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [], "throttle": "no_actions", "note": ""}
{
    "rule_id": "ac5a6409-8c89-44c2-8d64-668c29a2d756", 
    "id": "ac5a6409-8c89-44c2-8d64-668c29a2d756", 
    "author": ["https://elastic-content-share.eu","Arnim Rupp, Florian Roth"], 
    "from": "now-15m", "index": ["filebeat-*","logs-*"], 
    "interval": "5m", 
    "language": "lucene", 
    "output_index": ".siem-signals-default", 
    "references": ["https://support.citrix.com/article/CTX267679", "https://support.citrix.com/article/CTX267027", "https://isc.sans.edu/diary/25686", "https://twitter.com/mpgn_x64/status/1216787131210829826", "https://github.com/x1sec/x1sec.github.io/blob/master/CVE-2019-19781-DFIR.md"], 
    "false_positives": ["Unknown"], 
    "risk_score": 100, 
    "name": "Citrix Netscaler Attack CVE-2019-19781", 
    "description": "Detects CVE-2019-19781 exploitation attempt against Citrix Netscaler, Application Delivery Controller and Citrix Gateway Attack", 
    "query": "url.original:(*\\/..\\/vpns\\/* OR *\\/vpns\\/cfg\\/smb.conf OR *\\/vpns\\/portal\\/scripts\\/*.pl*)", 
    "severity": "critical", 
    "tags": ["elastic-content-share","Sigma","web"], 
    "to": "now", 
    "type": "query", 
    "threat": [{"framework": "MITRE ATT&CK", 
    "tactic": {"id": "TA0001", "name": "Initial Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, 
    "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], 
    "throttle": "no_actions", "note": ""}















{"rule_id": "0d0d9a8a-a49e-4e27-b061-7ce4b936cfb7", "id": "0d0d9a8a-a49e-4e27-b061-7ce4b936cfb7", "author": ["https://elastic-content-share.eu","Florian Roth"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://support.citrix.com/article/CTX276688", "https://research.nccgroup.com/2020/07/10/rift-citrix-adc-vulnerabilities-cve-2020-8193-cve-2020-8195-and-cve-2020-8196-intelligence/", "https://dmaasland.github.io/posts/citrix.html"], "false_positives": ["Unknown"], "risk_score": 100, "name": "Citrix ADS Exploitation CVE-2020-8193 CVE-2020-8195", "description": "Detects exploitation attempt against Citrix Netscaler, Application Delivery Controller (ADS) and Citrix Gateway exploiting vulnerabilities reported as CVE-2020-8193 and CVE-2020-8195", "query": "(url.original:(*\\/rapi\\/filedownload?filter\\=path\\:%2F*) OR (url.original:*\\/pcidss\\/report* AND url.original:*type\\=all_signatures* AND url.original:*sig_name\\=_default_signature_*))", "severity": "critical", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0001", "name": "Initial Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "throttle": "no_actions", "note": ""}
{"rule_id": "37e8369b-43bb-4bf8-83b6-6dd43bda2000", "id": "37e8369b-43bb-4bf8-83b6-6dd43bda2000", "author": ["https://elastic-content-share.eu","Florian Roth"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-2894", "https://twitter.com/pyn3rd/status/1020620932967223296", "https://github.com/LandGrey/CVE-2018-2894"], "false_positives": ["Unknown"], "risk_score": 100, "name": "Oracle WebLogic Exploit", "description": "Detects access to a webshell dropped into a keystore folder on the WebLogic server", "query": "url.original:(*\\/config\\/keystore\\/*.js*)", "severity": "critical", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [], "throttle": "no_actions", "note": ""}
{"rule_id": "e9bc39ae-978a-4e49-91ab-5bd481fc668b", "id": "e9bc39ae-978a-4e49-91ab-5bd481fc668b", "author": ["https://elastic-content-share.eu","Florian Roth"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://devcentral.f5.com/s/articles/confluence-arbitrary-file-write-via-path-traversal-cve-2019-3398-34181"], "false_positives": ["Unknown"], "risk_score": 100, "name": "Confluence Exploitation CVE-2019-3398", "description": "Detects the exploitation of the Confluence vulnerability described in CVE-2019-3398", "query": "(http.request.method:\"POST\" AND url.original:*\\/upload.action* AND url.original:*filename\\=..\\/..\\/..\\/..\\/*)", "severity": "critical", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0001", "name": "Initial Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "throttle": "no_actions", "note": ""}
{"rule_id": "fce2c2e2-0fb5-41ab-a14c-5391e1fd70a5", "id": "fce2c2e2-0fb5-41ab-a14c-5391e1fd70a5", "author": ["https://elastic-content-share.eu","Florian Roth"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://www.trustedsec.com/blog/detecting-cve-20200688-remote-code-execution-vulnerability-on-microsoft-exchange-server/"], "false_positives": ["Unknown"], "risk_score": 100, "name": "CVE-2020-0688 Exchange Exploitation via Web Log", "description": "Detects the exploitation of Microsoft Exchange vulnerability as described in CVE-2020-0688", "query": "(http.request.method:\"GET\" AND url.original:(*\\/ecp\\/* OR *\\/owa\\/*) AND url.original:*__VIEWSTATE\\=*)", "severity": "critical", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0001", "name": "Initial Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "throttle": "no_actions", "note": ""}
{"rule_id": "85d466b0-d74c-4514-84d3-2bdd3327588b", "id": "85d466b0-d74c-4514-84d3-2bdd3327588b", "author": ["https://elastic-content-share.eu","Florian Roth"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-14882", "https://isc.sans.edu/diary/26734", "https://twitter.com/jas502n/status/1321416053050667009?s=20", "https://twitter.com/sudo_sudoka/status/1323951871078223874"], "false_positives": ["Unknown"], "risk_score": 75, "name": "Oracle WebLogic Exploit CVE-2020-14882", "description": "Detects exploitation attempts on WebLogic servers", "query": "url.original:(*\\/console\\/images\\/%252E%252E%252Fconsole.portal* OR *\\/console\\/css\\/%2e*)", "severity": "high", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [], "throttle": "no_actions", "note": ""}
{"rule_id": "aba47adc-4847-4970-95c1-61dce62a8b29", "id": "aba47adc-4847-4970-95c1-61dce62a8b29", "author": ["https://elastic-content-share.eu","Florian Roth"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-3452", "https://twitter.com/aboul3la/status/1286012324722155525", "https://github.com/darklotuskdb/CISCO-CVE-2020-3452-Scanner-Exploiter"], "false_positives": ["Unknown"], "risk_score": 75, "name": "Cisco ASA FTD Exploit CVE-2020-3452", "description": "Detects exploitation attempts on Cisco ASA FTD systems exploiting CVE-2020-3452 with a status code of 200 (sccessful exploitation)", "query": "(url.original:(*\\+CSCOT\\+\\/translation\\-table* OR *\\+CSCOT\\+\\/oem\\-customization*) AND url.original:(*&textdomain\\=\\/* OR *&textdomain\\=%* OR *&name\\=\\/* OR *&name\\=%*) AND http.response.status_code:\"200\")", "severity": "high", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [], "throttle": "no_actions", "note": ""}
{"rule_id": "44b53b1c-e60f-4a7b-948e-3435a7918478", "id": "44b53b1c-e60f-4a7b-948e-3435a7918478", "author": ["https://elastic-content-share.eu","Florian Roth"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://support.f5.com/csp/article/K52145254", "https://www.ptsecurity.com/ww-en/about/news/f5-fixes-critical-vulnerability-discovered-by-positive-technologies-in-big-ip-application-delivery-controller/", "https://twitter.com/yorickkoster/status/1279709009151434754", "https://www.criticalstart.com/f5-big-ip-remote-code-execution-exploit/"], "false_positives": ["Unknown"], "risk_score": 100, "name": "CVE-2020-5902 F5 BIG-IP Exploitation Attempt", "description": "Detects the exploitation attempt of the vulnerability found in F5 BIG-IP and described in CVE-2020-5902", "query": "(url.original:(*\\/tmui\\/* OR *\\/hsqldb*) AND url.original:(*..;\\/* OR *.jsp\\/..*))", "severity": "critical", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0001", "name": "Initial Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "throttle": "no_actions", "note": ""}
{"rule_id": "687f6504-7f44-4549-91fc-f07bab065821", "id": "687f6504-7f44-4549-91fc-f07bab065821", "author": ["https://elastic-content-share.eu","Bhabesh Raj"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://twitter.com/pyn3rd/status/1351696768065409026", "https://mp.weixin.qq.com/s/wX9TMXl1KVWwB_k6EZOklw"], "false_positives": ["Unknown"], "risk_score": 100, "name": "Oracle WebLogic Exploit CVE-2021-2109", "description": "Detects the exploitation of the WebLogic server vulnerability described in CVE-2021-2109", "query": "(http.request.method:\"GET\" AND url.original:*com.bea.console.handles.JndiBindingHandle* AND url.original:*ldap\\:\\/\\/* AND url.original:*AdminServer*)", "severity": "critical", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [], "throttle": "no_actions", "note": ""}
{"rule_id": "77586a7f-7ea4-4c41-b19c-820140b84ca9", "id": "77586a7f-7ea4-4c41-b19c-820140b84ca9", "author": ["https://elastic-content-share.eu","Bhabesh Raj"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://cve.mitre.org/cgi-bin/cvename.cgi?name=2021-21978", "https://twitter.com/wugeej/status/1369476795255320580", "https://paper.seebug.org/1495/"], "false_positives": ["None"], "risk_score": 75, "name": "CVE-2021-21978 Exploitation Attempt", "description": "Detects the exploitation of the VMware View Planner vulnerability described in CVE-2021-21978", "query": "(http.request.method:\"POST\" AND url.original:*logupload* AND url.original:*logMetaData* AND url.original:*wsgi_log_upload.py*)", "severity": "high", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0001", "name": "Initial Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "throttle": "no_actions", "note": ""}
{"rule_id": "7c64e577-d72e-4c3d-9d75-8de6d1f9146a", "id": "7c64e577-d72e-4c3d-9d75-8de6d1f9146a", "author": ["https://elastic-content-share.eu","NVISO"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://github.com/Ridter/cve-2020-0688"], "false_positives": ["Unknown"], "risk_score": 75, "name": "CVE-2020-0688 Exploitation Attempt", "description": "Detects CVE-2020-0688 Exploitation attempts", "query": "(url.original:*\\/ecp\\/default.aspx* AND url.original:*__VIEWSTATEGENERATOR\\=* AND url.original:*__VIEWSTATE\\=*)", "severity": "high", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0001", "name": "Initial Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "throttle": "no_actions", "note": ""}
{"rule_id": "67bce556-312f-4c81-9162-c3c9ff2599b2", "id": "67bce556-312f-4c81-9162-c3c9ff2599b2", "author": ["https://elastic-content-share.eu","Florian Roth"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/", "https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/"], "false_positives": ["Legitimate access to other web applications that use the same folder names as Exchange (e.g. owa, ecp) but are not Microsoft Exchange related"], "risk_score": 75, "name": "Exchange Exploitation Used by HAFNIUM", "description": "Detects exploitation attempts in Exchange server logs as described in blog posts reporting on HAFNIUM group activity", "query": "(http.request.method:\"POST\" AND (url.original:*\\/owa\\/auth\\/Current\\/themes\\/resources\\/* OR (url.original:*\\/owa\\/auth\\/Current\\/* AND user_agent.original:(\"DuckDuckBot\\/1.0;\\+\\(\\+http\\:\\/\\/duckduckgo.com\\/duckduckbot.html\\)\" OR \"facebookexternalhit\\/1.1\\+\\(\\+http\\:\\/\\/www.facebook.com\\/externalhit_uatext.php\\)\" OR \"Mozilla\\/5.0\\+\\(compatible;\\+Baiduspider\\/2.0;\\+\\+http\\:\\/\\/www.baidu.com\\/search\\/spider.html\\)\" OR \"Mozilla\\/5.0\\+\\(compatible;\\+Bingbot\\/2.0;\\+\\+http\\:\\/\\/www.bing.com\\/bingbot.htm\\)\" OR \"Mozilla\\/5.0\\+\\(compatible;\\+Googlebot\\/2.1;\\+\\+http\\:\\/\\/www.google.com\\/bot.html\" OR \"Mozilla\\/5.0\\+\\(compatible;\\+Konqueror\\/3.5;\\+Linux\\)\\+KHTML\\/3.5.5\\+\\(like\\+Gecko\\)\\+\\(Exabot\\-Thumbnails\\)\" OR \"Mozilla\\/5.0\\+\\(compatible;\\+Yahoo\\!\\+Slurp;\\+http\\:\\/\\/help.yahoo.com\\/help\\/us\\/ysearch\\/slurp\\)\" OR \"Mozilla\\/5.0\\+\\(compatible;\\+YandexBot\\/3.0;\\+\\+http\\:\\/\\/yandex.com\\/bots\\)\" OR \"Mozilla\\/5.0\\+\\(X11;\\+Linux\\+x86_64\\)\\+AppleWebKit\\/537.36\\+\\(KHTML,\\+like\\+Gecko\\)\\+Chrome\\/51.0.2704.103\\+Safari\\/537.36\")) OR (url.original:*\\/ecp\\/* AND user_agent.original:(\"ExchangeServicesClient\\/0.0.0.0\" OR \"python\\-requests\\/2.19.1\" OR \"python\\-requests\\/2.25.1\")) OR (url.original:(*\\/aspnet_client\\/* OR *\\/owa\\/*) AND user_agent.original:(\"antSword\\/v2.1\" OR \"Googlebot\\/2.1\\+\\(\\+http\\:\\/\\/www.googlebot.com\\/bot.html\\)\" OR \"Mozilla\\/5.0\\+\\(compatible;\\+Baiduspider\\/2.0;\\+\\+http\\:\\/\\/www.baidu.com\\/search\\/spider.html\\)\")) OR url.original:(*\\/owa\\/auth\\/Current\\/* OR *\\/ecp\\/default.flt* OR *\\/ecp\\/main.css*) OR (url.original:*\\/ecp\\/* AND url.original:*.js*)))", "severity": "high", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0001", "name": "Initial Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "throttle": "no_actions", "note": ""}
{"rule_id": "a2e97350-4285-43f2-a63f-d0daff291738", "id": "a2e97350-4285-43f2-a63f-d0daff291738", "author": ["https://elastic-content-share.eu","Bhabesh Raj"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://devco.re/blog/2019/08/09/attacking-ssl-vpn-part-2-breaking-the-Fortigate-ssl-vpn/"], "false_positives": ["Unknown"], "risk_score": 100, "name": "Fortinet CVE-2018-13379 Exploitation", "description": "Detects CVE-2018-13379 exploitation attempt against Fortinet SSL VPNs", "query": "(url.original:*lang\\=\\/..\\/..\\/* AND url.original:*\\/dev\\/cmdb\\/sslvpn_websession*)", "severity": "critical", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0001", "name": "Initial Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "throttle": "no_actions", "note": ""}
{"rule_id": "2dbc10d7-a797-49a8-8776-49efa6442e60", "id": "2dbc10d7-a797-49a8-8776-49efa6442e60", "author": ["https://elastic-content-share.eu","Florian Roth"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://www.exploit-db.com/exploits/47297"], "false_positives": ["Unknown"], "risk_score": 100, "name": "Pulse Secure Attack CVE-2019-11510", "description": "Detects CVE-2019-11510 exploitation attempt - URI contains Guacamole", "query": "url.original:*?\\/dana\\/html5acc\\/guacamole\\/*", "severity": "critical", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0001", "name": "Initial Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "throttle": "no_actions", "note": ""}
{"rule_id": "5a35116f-43bc-4901-b62d-ef131f42a9af", "id": "5a35116f-43bc-4901-b62d-ef131f42a9af", "author": ["https://elastic-content-share.eu","Bhabesh Raj"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://kb.cert.org/vuls/id/843464"], "false_positives": ["Unknown"], "risk_score": 100, "name": "CVE-2020-10148 SolarWinds Orion API Auth Bypass", "description": "Detects CVE-2020-10148 SolarWinds Orion API authentication bypass attempts", "query": "((url.original:(*WebResource.axd* OR *ScriptResource.axd* OR *i18n.ashx* OR *Skipi18n*) AND (NOT (url.original:*Orion\\/Skipi18n\\/Profiler\\/*))) AND (NOT (url.original:(*css.i18n.ashx* OR *js.i18n.ashx*))))", "severity": "critical", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0001", "name": "Initial Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "throttle": "no_actions", "note": ""}
{"rule_id": "a2cee20b-eacc-459f-861d-c02e5d12f1db", "id": "a2cee20b-eacc-459f-861d-c02e5d12f1db", "author": ["https://elastic-content-share.eu","Florian Roth"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://www.guidepointsecurity.com/supernova-solarwinds-net-webshell-analysis/", "https://www.anquanke.com/post/id/226029"], "false_positives": ["Unknown"], "risk_score": 100, "name": "Solarwinds SUPERNOVA Webshell Access", "description": "Detects access to SUPERNOVA webshell as described in Guidepoint report", "query": "((url.original:*logoimagehandler.ashx* AND url.original:*clazz*) OR (url.original:(*logoimagehandler.ashx*) AND http.response.status_code:\"500\"))", "severity": "critical", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0003", "name": "Persistence", "reference": "https://attack.mitre.org/tactics/TA0003"}, "technique": [{"id": "T1505.003", "name": "Web Shell", "reference": "https://attack.mitre.org/techniques/T1505/003"}]}], "throttle": "no_actions", "note": ""}
{"rule_id": "6f55f047-112b-4101-ad32-43913f52db46", "id": "6f55f047-112b-4101-ad32-43913f52db46", "author": ["https://elastic-content-share.eu","Florian Roth"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://darrenmartyn.ie/2021/01/24/visualdoor-sonicwall-ssl-vpn-exploit/"], "false_positives": ["Unknown"], "risk_score": 75, "name": "SonicWall SSL/VPN Jarrewrite Exploit", "description": "Detects exploitation attempts of the SonicWall Jarrewrite Exploit", "query": "(url.original:*\\/cgi\\-bin\\/jarrewrite.sh* AND user_agent.original:(*\\:;* OR *\\(\\)\\ \\{* OR *\\/bin\\/bash\\ \\-c*))", "severity": "high", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [], "throttle": "no_actions", "note": ""}
{"rule_id": "953d460b-f810-420a-97a2-cfca4c98e602", "id": "953d460b-f810-420a-97a2-cfca4c98e602", "author": ["https://elastic-content-share.eu","James Ahearn"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://pentester.land/tutorials/2018/10/25/source-code-disclosure-via-exposed-git-folder.html", "https://medium.com/@logicbomb_1/bugbounty-how-i-was-able-to-download-the-source-code-of-indias-largest-telecom-service-52cf5c5640a1"], "false_positives": ["unknown"], "risk_score": 50, "name": "Source Code Enumeration Detection by Keyword", "description": "Detects source code enumeration that use GET requests by keyword searches in URL strings", "query": "*.git\\/*", "severity": "medium", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0007", "name": "Discovery", "reference": "https://attack.mitre.org/tactics/TA0007"}, "technique": [{"id": "T1083", "name": "File and Directory Discovery", "reference": "https://attack.mitre.org/techniques/T1083"}]}], "throttle": "no_actions", "note": ""}
{"rule_id": "15c312b9-00d0-4feb-8870-7d940a4bdc5e", "id": "15c312b9-00d0-4feb-8870-7d940a4bdc5e", "author": ["https://elastic-content-share.eu","Bhabesh Raj"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://www.ihteam.net/advisory/terramaster-tos-multiple-vulnerabilities/", "https://nvd.nist.gov/vuln/detail/CVE-2020-28188", "https://research.checkpoint.com/2021/freakout-leveraging-newest-vulnerabilities-for-creating-a-botnet/"], "false_positives": ["Unknown"], "risk_score": 100, "name": "TerraMaster TOS CVE-2020-28188", "description": "Detects the exploitation of the TerraMaster TOS vulnerability described in CVE-2020-28188", "query": "(http.request.method:\"GET\" AND url.original:*\\/include\\/makecvs.php* AND url.original:*?Event\\=* AND url.original:(*curl* OR *wget* OR *.py* OR *.sh* OR *chmod* OR *_GET*))", "severity": "critical", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [], "throttle": "no_actions", "note": ""}
{"rule_id": "fdf96c90-42d5-4406-8a9c-14a2c9a016b5", "id": "fdf96c90-42d5-4406-8a9c-14a2c9a016b5", "author": ["https://elastic-content-share.eu","Florian Roth"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://www.fireeye.com/blog/threat-research/2021/02/accellion-fta-exploited-for-data-theft-and-extortion.html"], "false_positives": ["Unknown"], "risk_score": 100, "name": "DEWMODE Webshell Access", "description": "Detects access to DEWMODE webshell as described in FIREEYE report", "query": "(url.original:*.html?* AND ((url.original:*?dwn\\=* AND url.original:*&fn\\=*) OR (url.original:*&dwn\\=* AND url.original:*?fn\\=*)))", "severity": "critical", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0003", "name": "Persistence", "reference": "https://attack.mitre.org/tactics/TA0003"}, "technique": [{"id": "T1505.003", "name": "Web Shell", "reference": "https://attack.mitre.org/techniques/T1505/003"}]}], "throttle": "no_actions", "note": ""}
{"rule_id": "179ed852-0f9b-4009-93a7-68475910fd86", "id": "179ed852-0f9b-4009-93a7-68475910fd86", "author": ["https://elastic-content-share.eu","Bhabesh Raj"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://www.vmware.com/security/advisories/VMSA-2021-0002.html", "https://f5.pm/go-59627.html", "https://swarm.ptsecurity.com/unauth-rce-vmware"], "false_positives": ["OVA uploads to your VSphere appliance"], "risk_score": 75, "name": "CVE-2021-21972 VSphere Exploitation", "description": "Detects the exploitation of VSphere Remote Code Execution vulnerability as described in CVE-2021-21972", "query": "(http.request.method:\"POST\" AND url.original:(\"\\/ui\\/vropspluginui\\/rest\\/services\\/uploadova\"))", "severity": "high", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0001", "name": "Initial Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "throttle": "no_actions", "note": ""}
{"rule_id": "7ff9db12-1b94-4a79-ba68-a2402c5d6729", "id": "7ff9db12-1b94-4a79-ba68-a2402c5d6729", "author": ["https://elastic-content-share.eu","Florian Roth"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": [], "false_positives": ["Web sites like wikis with articles on os commands and pages that include the os commands in the URLs", "User searches in search boxes of the respective website"], "risk_score": 75, "name": "Webshell Detection by Keyword", "description": "Detects webshells that use GET requests by keyword searches in URL strings", "query": "\\*url.original:(*\\=whoami* OR *\\=net%20user* OR *\\=cmd%20\\/c%20*)", "severity": "high", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0003", "name": "Persistence", "reference": "https://attack.mitre.org/tactics/TA0003"}, "technique": [{"id": "t1100", "name": "t1100", "reference": ""}, {"id": "T1505.003", "name": "Web Shell", "reference": "https://attack.mitre.org/techniques/T1505/003"}]}], "throttle": "no_actions", "note": ""}
{"rule_id": "25676e10-2121-446e-80a4-71ff8506af47", "id": "25676e10-2121-446e-80a4-71ff8506af47", "author": ["https://elastic-content-share.eu","FPT.EagleEye"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/", "https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/"], "false_positives": ["Unknown"], "risk_score": 75, "name": "Exchange PowerShell Snap-Ins Used by HAFNIUM", "description": "Detects adding and using Exchange PowerShell snap-ins to export mailbox data by HAFNIUM", "query": "(Image.keyword:*\\\\powershell.exe AND CommandLine.keyword:(*add\\-pssnapin\\ microsoft.exchange.powershell.snapin*))", "severity": "high", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0002", "name": "Execution", "reference": "https://attack.mitre.org/tactics/TA0002"}, "technique": [{"id": "t1086", "name": "t1086", "reference": ""}, {"id": "T1059.005", "name": "Visual Basic", "reference": "https://attack.mitre.org/techniques/T1059/005"}]}, {"framework": "MITRE ATT&CK", "tactic": {"id": "TA0009", "name": "Collection", "reference": "https://attack.mitre.org/tactics/TA0009"}, "technique": [{"id": "T1114", "name": "Email Collection", "reference": "https://attack.mitre.org/techniques/T1114"}]}], "throttle": "no_actions", "note": ""}
{"rule_id": "2ea44a60-cfda-11ea-87d0-0242ac130003", "id": "2ea44a60-cfda-11ea-87d0-0242ac130003", "author": ["https://elastic-content-share.eu","Cian Heasley"], "from": "now-15m", "index": ["filebeat-*","logs-*"], "interval": "5m", "language": "lucene", "output_index": ".siem-signals-default", "references": ["https://community.rsa.com/community/products/netwitness/blog/2019/02/19/web-shells-and-netwitness-part-3", "https://github.com/sensepost/reGeorg"], "false_positives": ["web applications that use the same URL parameters as ReGeorg"], "risk_score": 75, "name": "Webshell ReGeorg Detection Via Web Logs", "description": "Certain strings in the uri_query field when combined with null referer and null user agent can indicate activity associated with the webshell ReGeorg.", "query": "(url.original:(*cmd\\=read* OR *connect&target* OR *cmd\\=connect* OR *cmd\\=disconnect* OR *cmd\\=forward*) AND NOT _exists_:referer AND NOT _exists_:user_agent.original AND http.request.method:\"POST\")", "severity": "high", "tags": ["elastic-content-share","Sigma","web"], "to": "now", "type": "query", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0003", "name": "Persistence", "reference": "https://attack.mitre.org/tactics/TA0003"}, "technique": [{"id": "t1100", "name": "t1100", "reference": ""}, {"id": "T1505.003", "name": "Web Shell", "reference": "https://attack.mitre.org/techniques/T1505/003"}]}], "throttle": "no_actions", "note": ""}
